backend/app/controllers/appointments_controller.rb

SELECT "appointment_types".* FROM "appointment_types" WHERE "appointment_types"."id" IN (?, ?)  [["id", 3], ["id", 4]]
SELECT "appointments".* FROM "appointments" ORDER BY "appointments"."starts_at" ASC
---
  def index
    @appointments = Appointment.includes(:appointment_type).order(:starts_at)

INSERT INTO "appointments" ("description", "notes", "appointment_type_id", "starts_at", "ends_at", "created_at", "updated_at", "title", "location", "people_of_interest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save

UPDATE "appointments" SET "updated_at" = ?, "people_of_interest" = ? WHERE "appointments"."id" = ?  [["updated_at", "2026-09-12 22:32:53.208736"], ["people_of_interest", "Ismael Lares, Tobias Lares, juan"], ["id", 2]]
---
  def update
    if @appointment.update(appointment_params)