backend/app/controllers/appointment_types_controller.rb

  def index
    @appointment_types = AppointmentType.all
---
SELECT "appointment_types".* FROM "appointment_types"

  def create
    @appointment_type = AppointmentType.new(appointment_type_params)

    if @appointment_type.save
---
INSERT INTO "appointment_types" ("name", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Meeting"], ["created_at", "2026-09-12 21:23:28.461998"], ["updated_at", "2026-09-12 21:23:28.461998"], ["color", "#3B82F6"]]

  def update
    if @appointment_type.update(appointment_type_params)
---
UPDATE "appointment_types" SET "updated_at" = ?, "color" = ? WHERE "appointment_types"."id" = ?  [["updated_at", "2026-09-13 00:48:42.754792"], ["color", "#ff0000"], ["id", 4]]

  def destroy
    @appointment_type.destroy!
---
DELETE FROM "appointment_types" WHERE "appointment_types"."id" = ?  [["id", 1]]

    def set_appointment_type
      @appointment_type = AppointmentType.find(params[:id])
---
SELECT "appointment_types".* FROM "appointment_types" WHERE "appointment_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]